---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoinStrengthOrder
source: html/805907a2-5b2c-4859-dcda-087325cb5eb9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoinStrengthOrder Property

"Abstract Join Strength Order"

## Syntax (C#)
```csharp
public static ForgeTypeId JoinStrengthOrder { get; }
```